{
	"certifications": [
		{
			"id": "CLF-C01",
			"title": "AWS Certified Cloud Practitioner",
			"certificationDate": "2021-11-29"
		},
		{
			"id": "SAA-C02",
			"title": "AWS Certified Software Solutions Architect - Associate",
			"certificationDate": "2021-11-30"
		}
	],
	"experiences": [
		{
			"organization": "We Are Alexander",
			"location": "Saint Louis, MO",
			"positions": [
				{
					"title": "Full Stack Web Developer",
					"summary": "Increased customer brand presence by developing 10 new microsites and launched new features for an internal event tracking application.",
					"startDate": "2014-05-27",
					"endDate": "2017-07-28",
					"activities": []
				}
			]
		},
		{
			"organization": "Sherpa CRM",
			"location": "Saint Louis, MO / Remote",
			"positions": [
				{
					"title": "Software Engineer",
					"summary": "Delivered new tools, features, and documentation best practices (in Confluence) and collaborated with multiple vendors during a long-term data warehouse build project essential for cross-company data analyses communicating the benefits of services to customers using benchmarks.",
					"startDate": "2017-08-07",
					"endDate": "2019-08-31",
					"activities": [
						{
							"summary": "Consolidated data from MySQL to S3 to Redshift by maintaining ETL code for AWS Data Migration Service, Batch jobs, and Lambdas and constructed OLAP data models for Redshift and Tableau data analysis."
						},
						{
							"summary": "Modernized analytics for customers by creating a customizable, shareable, schedulable reporting engine."
						}
					]
				},
				{
					"title": "Technical Lead",
					"summary": "Led and mentored a team of two front-end engineers and an intern during the creation of new improvements and coding best practices. Demonstrated continued success during the end-to-end completion of improvement and integration projects essential for optimizing multiple SDLC processes.",
					"startDate": "2019-09-01",
					"endDate": "2021-09-30",
					"activities": [
						{
							"summary": "Streamlined query performance by up to 95% for customers comprising millions of data records."
						},
						{
							"summary": "Overhauled web client data flow architecture to successfully normalize Redux state."
						},
						{
							"summary": "Spearheaded the seamless upgrade from React v15 to v16 to fully utlilize hooks and modern libraries."
						},
						{
							"summary": "Normalized MySQL data models by redesigning database tables with the product team and senior engineers."
						}
					]
				},
				{
					"title": "Software Engineering Manager",
					"summary": "Equipped a team of three with the leadership, mentorship, and skills needed for the successful creation of new tools and features. Translated abstract organizational and stakeholder needs into concrete designs and development strategies. Facilitated the completion of a merger by integrating company data through utilization of microservice frameworks.",
					"startDate": "2021-10-01",
					"endDate": "2023-04-18",
					"activities": [
						{
							"summary": "Enabled asynchronous data integration by collaborating with cross-functional staff during the creation of new Kafka providers and consumers."
						},
						{
							"summary": "Introduced forward and backward compatible versioned data transfer with extensible protobuf messages."
						},
						{
							"summary": "Achieved a 50% growth in development team size by guiding qualified candidates through the recruiting lifecycle prior to the delivery of in-depth mentorship and coaching."
						},
						{
							"summary": "Awarded with multiple vertical promotions during tenure due to track record of success."
						},
						{
							"summary": "Rolled out a \"contact consent\" feature to comply with GDPR preferences for UK/EU customers."
						}
					]
				}
			]
		}
	]
}